#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-L1LaNXDv4pvcF9ps

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.postgres.aws_volume_attachment.this: Refreshing state... [id=vai-1407318902]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
module.postgres.aws_ebs_volume.this: Refreshing state... [id=vol-0409995c95a306188]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.postgres.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.postgres.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.f2_instance.aws_iam_role.this: Refreshing state... [id=main-role]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
module.postgres.aws_iam_role.this: Refreshing state... [id=postgres-role]
module.f2_instance.aws_iam_instance_profile.this: Refreshing state... [id=main-instance-profile]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
module.postgres.aws_iam_instance_profile.this: Refreshing state... [id=postgres-instance-profile]
aws_route53_zone.internal: Refreshing state... [id=Z0474418KLUF1M8YKY2A]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
module.postgres.aws_security_group.this: Refreshing state... [id=sg-007170e1e0d4b37a3]
module.f2_instance.aws_security_group.this: Refreshing state... [id=sg-084f10e5da8977ef8]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.postgres.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-1362233703]
module.postgres.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3052576158]
module.postgres.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-2551868066]
module.postgres.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-596259391]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.f2_instance.data.aws_subnet.self: Refreshing...
module.postgres.data.aws_subnet.self: Refreshing...
module.f2_instance.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1085682246]
module.f2_instance.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-4081642417]
module.f2_instance.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-2409512323]
module.f2_instance.data.aws_subnet.self: Refresh complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.f2_instance.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-2980093754]
module.postgres.data.aws_subnet.self: Refresh complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.f2_instance.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1153391225]
module.f2_instance.aws_instance.this: Refreshing state... [id=i-0bdb939a052debb4b]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
module.f2_instance.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-934331843]
module.postgres.aws_instance.this: Refreshing state... [id=i-06b6e35925cc40c70]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.postgres.aws_security_group_rule.allow_inbound_connections_from_instances["sg-084f10e5da8977ef8"]: Refreshing state... [id=sgrule-4147220582]
module.postgres.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/postgres-policy]
module.f2_instance.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/main-policy]
module.postgres.aws_iam_role_policy_attachment.this: Refreshing state... [id=postgres-role-20230829203241003500000001]
module.f2_instance.aws_iam_role_policy_attachment.this: Refreshing state... [id=main-role-20230829053104189100000001]
module.f2_instance.aws_eip.this: Refreshing state... [id=eipalloc-0e2eced5b3f96fdd0]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
module.postgres.aws_eip.this: Refreshing state... [id=eipalloc-0a20bfd06efbf7f25]
aws_route53_record.internal_postgres: Refreshing state... [id=Z0474418KLUF1M8YKY2A_postgres_CNAME]
aws_route53_record.postgres: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_postgres_A]
aws_iam_user.configuration_deployer: Drift detected (update)
module.postgres.aws_instance.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_access_key.configuration_deployer will be destroyed
  - resource "aws_iam_access_key" "configuration_deployer" {
      - create_date                    = "2023-09-16T19:04:51Z" -> null
      - encrypted_secret               = "wV4DCD+fPm/O2bASAQdAsW7wevQYzl/M6aWIRfpmz+UTDuZ3SvWSjVAtM3aHMwAwsWIScETFYMzBqfw8cYE7WCN3xVZ+GNADMBTkf31pccTXcvZyIk61duTnEJUoUXPG0lkBWxGnf+qkhvg+4/OMHFwwUuONoSgeEEwfc2DFdMZJQakuCTLis+ZEALicT+ptcIPThyFzDBYSBXG6dMySo++qQhyYM9ewVI9E82uP3NqNsdDxCpqDlnohpw==" -> null
      - encrypted_ses_smtp_password_v4 = "wV4DCD+fPm/O2bASAQdAkFGqNda/x04mk/hs1Us18nt3qsCtCCw7BB78YGQUSBIwx2CscRiZOJZAz6aolKN5uMhmw1Da2QwcHwkDHLOovFFWwR8vtBUNtlIfVs8w3nRi0l0BfW9ugi5QGAen/H6yxxNYehkUm648KEW8GKSrg3FFmCUETgcwHyXIr6cKw3LX/q0pEXs05vmsLuzU1VrpagxLCqRcSNayuUmuEnhW1IrWTApFHqgzmh+kZva4c4Q=" -> null
      - id                             = "AKIAYEHTA3LZKXOXWTYC" -> null
      - key_fingerprint                = "34158575da048366a6f78818caace6c3f7a85dad" -> null
      - pgp_key                        = <<-EOT
            mDMEZEIvBhYJKwYBBAHaRw8BAQdAH6uzDXu/qjfZ8Da+qVhNJT4zsQVLJZfEwoO863fMzM+0M0FsZXhhbmRlciBKYWNrc29uIDxhbGV4YW5kZXJqYWNrc29uQHByb3Rvbm1haWwuY29tPoiZBBMWCgBBFiEENBWFddoEg2am94gYyqzmw/eoXa0FAmRCLwYCGwMFCQPCZwAFCwkIBwICIgIGFQoJCAsCBBYCAwECHgcCF4AACgkQyqzmw/eoXa3WfgD+P4SmEYWrqcxIPpMWRR9gWBLX7iU0doH1t/oGuWhEiyoBAJ20LujsrDFFe8Aw9dgyM3pZ07I+U5aGpbJyLEXAtfIHuDgEZEIvBhIKKwYBBAGXVQEFAQEHQOrRfaG6AGPd9xWWiQgO3LDLgZi/tAitK/g8VCIWrU9cAwEIB4h+BBgWCgAmFiEENBWFddoEg2am94gYyqzmw/eoXa0FAmRCLwYCGwwFCQPCZwAACgkQyqzmw/eoXa02HwD/V++JOMjmTLeds+ouVcSJ6qCq7Rtb3dIKysCnzqd49ToA/1Fv+vWnbkrJg8gOSeU/qKJPZwfYkBqWwv8ozEIlzFwG
        EOT -> null
      - status                         = "Active" -> null
      - user                           = "configuration.deployer" -> null
    }

  # aws_iam_user.configuration_deployer will be destroyed
  - resource "aws_iam_user" "configuration_deployer" {
      - arn           = "arn:aws:iam::558855412466:user/configuration.deployer" -> null
      - force_destroy = false -> null
      - id            = "configuration.deployer" -> null
      - name          = "configuration.deployer" -> null
      - path          = "/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDAYEHTA3LZAPPXXQQSH" -> null
    }

  # aws_iam_user_policy.configuration_deployer will be destroyed
  - resource "aws_iam_user_policy" "configuration_deployer" {
      - id     = "configuration.deployer:configuration.deployer.policy" -> null
      - name   = "configuration.deployer.policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::configuration-sfvz2s"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::configuration-sfvz2s/f2/config.yaml"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - user   = "configuration.deployer" -> null
    }

  # aws_route53_record.internal_postgres will be updated in-place
  ~ resource "aws_route53_record" "internal_postgres" {
        id                               = "Z0474418KLUF1M8YKY2A_postgres_CNAME"
        name                             = "postgres"
      ~ records                          = [
          - "ip-10-0-0-88.eu-west-1.compute.internal",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.f2_instance.aws_security_group_rule.allow_outbound_ssh will be created
  + resource "aws_security_group_rule" "allow_outbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound SSH to anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-084f10e5da8977ef8"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # module.postgres.aws_ebs_volume.this will be destroyed
  - resource "aws_ebs_volume" "this" {
      - arn                  = "arn:aws:ec2:eu-west-1:558855412466:volume/vol-0409995c95a306188" -> null
      - availability_zone    = "eu-west-1a" -> null
      - encrypted            = false -> null
      - final_snapshot       = false -> null
      - id                   = "vol-0409995c95a306188" -> null
      - iops                 = 3000 -> null
      - multi_attach_enabled = false -> null
      - size                 = 1 -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
      - throughput           = 125 -> null
      - type                 = "gp3" -> null
    }

  # module.postgres.aws_eip.this will be updated in-place
  ~ resource "aws_eip" "this" {
        id                   = "eipalloc-0a20bfd06efbf7f25"
      ~ instance             = "i-06b6e35925cc40c70" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # module.postgres.aws_instance.this must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:eu-west-1:558855412466:instance/i-06b6e35925cc40c70" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-06b6e35925cc40c70" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0ea3123f9d13ed1f3" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-88.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.88" -> (known after apply)
      ~ public_dns                           = "ec2-52-49-55-212.eu-west-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.49.55.212" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      - tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "35ce65ad9c684c2c60fcd69a28b914484e6105cc" -> "c4cfacc6fa7fc7e6aabb5adccfaecc9a52dd95db"
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdp" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0409995c95a306188" -> null
          - volume_size           = 1 -> null
          - volume_type           = "gp3" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06a5699a041916a81" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.postgres.aws_volume_attachment.this will be destroyed
  - resource "aws_volume_attachment" "this" {
      - device_name = "/dev/sdp" -> null
      - id          = "vai-1407318902" -> null
      - instance_id = "i-06b6e35925cc40c70" -> null
      - volume_id   = "vol-0409995c95a306188" -> null
    }

Plan: 2 to add, 2 to change, 6 to destroy.

```

</details>